In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s=pd.Series([1,2,3,4,5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
type(s)

pandas.core.series.Series

In [4]:
s[0]

1

In [5]:
s[1]

2

In [6]:
l=[1,2,3,4,5]
ns=pd.Series(l,index=['A','B','C','D','E'])
ns

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [7]:
l=['Apple','Mango','Pineapple','Chiku']
fruit=pd.Series(l,index=['Pink','Yellow','Gray','Brown'])
fruit

Pink          Apple
Yellow        Mango
Gray      Pineapple
Brown         Chiku
dtype: object

In [8]:
fruit['Yellow']

'Mango'

In [9]:
fruit['Brown']

'Chiku'

In [10]:
fruit=pd.Series(l,copy=False)
fruit.iloc[0]='Coconut'
fruit

0      Coconut
1        Mango
2    Pineapple
3        Chiku
dtype: object

In [11]:
fr=pd.Series(l,index=['Pink','Yellow','Green','Brown'])
fr

Pink          Apple
Yellow        Mango
Green     Pineapple
Brown         Chiku
dtype: object

In [12]:
fr['Green']='GreenApple'
fr

Pink           Apple
Yellow         Mango
Green     GreenApple
Brown          Chiku
dtype: object

In [13]:
fruit

0      Coconut
1        Mango
2    Pineapple
3        Chiku
dtype: object

In [14]:
fruit['Gray']='GreenApple'

In [15]:
fruit

0          Coconut
1            Mango
2        Pineapple
3            Chiku
Gray    GreenApple
dtype: object

In [16]:
emp={'Digvijay':10, 'Pravin':11, 'Umesh':12 }
emp_s=pd.Series(emp)
emp_s

Digvijay    10
Pravin      11
Umesh       12
dtype: int64

In [17]:
emp=(('Digvijay',10), ('Pravin',11), ('Umesh',12) )
emp_s=pd.Series(emp)
emp_s

0    (Digvijay, 10)
1      (Pravin, 11)
2       (Umesh, 12)
dtype: object

In [18]:
sub=(('A',10,'Pune','MH'),('B',20,'Sangli','MH'),('C',30,'Kolhapur','MH'))
sub_s=pd.Series(sub, index=['stud1 :','stud2 :',3])
sub_s

stud1 :        (A, 10, Pune, MH)
stud2 :      (B, 20, Sangli, MH)
3          (C, 30, Kolhapur, MH)
dtype: object

In [19]:
arr=np.arange(1,100,10)
arr_s=pd.Series(arr,index=[np.arange(1,200,20)])
arr_s

1       1
21     11
41     21
61     31
81     41
101    51
121    61
141    71
161    81
181    91
dtype: int32

In [20]:
s=pd.Series()
s,type(s)

(Series([], dtype: object), pandas.core.series.Series)

In [21]:
df=pd.DataFrame()
df,type(df)

(Empty DataFrame
 Columns: []
 Index: [],
 pandas.core.frame.DataFrame)

In [22]:
l=['fruits','eggs','meat','milk','greenleafy']
s=pd.Series(l)
s

0        fruits
1          eggs
2          meat
3          milk
4    greenleafy
dtype: object

In [23]:
rindex=pd.Series(l,index=['A','B','C','D','E'])
rindex

A        fruits
B          eggs
C          meat
D          milk
E    greenleafy
dtype: object

In [24]:
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [25]:
df,type(df)

(Empty DataFrame
 Columns: []
 Index: [],
 pandas.core.frame.DataFrame)

In [26]:
student={
    'Name':['A','B','C'],
    'Age' :[30, 31, 32],
    'Sex' :['M', 'F', 'M']
    }
df=pd.DataFrame(student,index=['Rahul','Priya','Sandip'])
df

       Name  Age Sex
Rahul     A   30   M
Priya     B   31   F
Sandip    C   32   M

In [27]:
df.loc[['Rahul','Sandip']]

       Name  Age Sex
Rahul     A   30   M
Sandip    C   32   M

In [28]:
print(df.to_string())

       Name  Age Sex
Rahul     A   30   M
Priya     B   31   F
Sandip    C   32   M

In [29]:
print(pd.options.display.max_rows)

60

In [30]:
print(pd.options.display.min_rows)

10

In [31]:
pd.options.display.max_categories

8

In [32]:
df=pd.read_csv('air_quality.csv')
df

                 datetime  station_antwerp  station_paris  station_london
0     2019-05-07 02:00:00              NaN            NaN            23.0
1     2019-05-07 03:00:00             50.5           25.0            19.0
2     2019-05-07 04:00:00             45.0           27.7            19.0
3     2019-05-07 05:00:00              NaN           50.4            16.0
4     2019-05-07 06:00:00              NaN           61.9             NaN
...                   ...              ...            ...             ...
1030  2019-06-20 22:00:00              NaN           21.4             NaN
1031  2019-06-20 23:00:00              NaN           24.9             NaN
1032  2019-06-21 00:00:00              NaN           26.5             NaN
1033  2019-06-21 01:00:00              NaN           21.8             NaN
1034  2019-06-21 02:00:00              NaN           20.0             NaN

[1035 rows x 4 columns]

In [33]:
df.head(10)

              datetime  station_antwerp  station_paris  station_london
0  2019-05-07 02:00:00              NaN            NaN            23.0
1  2019-05-07 03:00:00             50.5           25.0            19.0
2  2019-05-07 04:00:00             45.0           27.7            19.0
3  2019-05-07 05:00:00              NaN           50.4            16.0
4  2019-05-07 06:00:00              NaN           61.9             NaN
5  2019-05-07 07:00:00              NaN           72.4            26.0
6  2019-05-07 08:00:00              NaN           77.7            32.0
7  2019-05-07 09:00:00              NaN           67.9            32.0
8  2019-05-07 10:00:00              NaN           56.0            28.0
9  2019-05-07 11:00:00              NaN           34.5            21.0

In [34]:
df.shape

(1035, 4)

In [35]:
df.tail(30)

                 datetime  station_antwerp  station_paris  station_london
1005  2019-06-17 23:00:00              NaN           38.3             NaN
1006  2019-06-18 00:00:00              NaN           51.0             NaN
1007  2019-06-18 01:00:00              NaN           73.3             NaN
1008  2019-06-18 02:00:00              NaN           66.2             NaN
1009  2019-06-18 03:00:00              NaN           60.1             NaN
1010  2019-06-18 04:00:00              NaN           39.8             NaN
1011  2019-06-18 05:00:00              NaN           45.5             NaN
1012  2019-06-18 06:00:00              NaN           26.5             NaN
1013  2019-06-18 07:00:00              NaN           33.8             NaN
1014  2019-06-18 08:00:00              NaN           51.4             NaN
1015  2019-06-18 09:00:00              NaN           52.6             NaN
1016  2019-06-18 10:00:00              NaN           49.6             NaN
1017  2019-06-18 21:00:00              NaN           15.3             NaN
1018  2019-06-18 22:00:00              NaN           17.0             NaN
1019  2019-06-18 23:00:00              NaN           23.1             NaN
1020  2019-06-19 00:00:00              NaN           39.3             NaN
1021  2019-06-19 11:00:00              NaN           27.3             NaN
1022  2019-06-19 12:00:00              NaN           26.6             NaN
1023  2019-06-20 15:00:00              NaN           19.4             NaN
1024  2019-06-20 16:00:00              NaN           20.1             NaN
1025  2019-06-20 17:00:00              NaN           19.3             NaN
1026  2019-06-20 18:00:00              NaN           19.0             NaN
1027  2019-06-20 19:00:00              NaN           23.2             NaN
1028  2019-06-20 20:00:00              NaN           23.9             NaN
1029  2019-06-20 21:00:00              NaN           25.3             NaN
1030  2019-06-20 22:00:00              NaN           21.4             NaN
1031  2019-06-20 23:00:00              NaN           24.9             NaN
1032  2019-06-21 00:00:00              NaN           26.5             NaN
1033  2019-06-21 01:00:00              NaN           21.8             NaN
1034  2019-06-21 02:00:00              NaN           20.0             NaN

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   datetime         1035 non-null   object
 1   station_antwerp  95 non-null     float64
 2   station_paris    1004 non-null   float64
 3   station_london   969 non-null    float64
dtypes: float64(3), object(1)
memory usage: 32.5+ KB

In [37]:
df.describe()

       station_antwerp  station_paris  station_london
count        95.000000    1004.000000      969.000000
mean         25.778947      27.740538       24.689370
std          12.682019      15.285746       11.296598
min           7.500000       0.000000        0.000000
25%          16.750000      16.500000       18.000000
50%          23.000000      24.150000       25.000000
75%          34.500000      35.925000       31.000000
max          74.500000      97.000000       97.000000

In [38]:
# df.corr()

In [39]:
df1=df.copy()
df1

                 datetime  station_antwerp  station_paris  station_london
0     2019-05-07 02:00:00              NaN            NaN            23.0
1     2019-05-07 03:00:00             50.5           25.0            19.0
2     2019-05-07 04:00:00             45.0           27.7            19.0
3     2019-05-07 05:00:00              NaN           50.4            16.0
4     2019-05-07 06:00:00              NaN           61.9             NaN
...                   ...              ...            ...             ...
1030  2019-06-20 22:00:00              NaN           21.4             NaN
1031  2019-06-20 23:00:00              NaN           24.9             NaN
1032  2019-06-21 00:00:00              NaN           26.5             NaN
1033  2019-06-21 01:00:00              NaN           21.8             NaN
1034  2019-06-21 02:00:00              NaN           20.0             NaN

[1035 rows x 4 columns]

In [41]:
df.head(10)

              datetime  station_antwerp  station_paris  station_london
0  2019-05-07 02:00:00              NaN            NaN            23.0
1  2019-05-07 03:00:00             50.5           25.0            19.0
2  2019-05-07 04:00:00             45.0           27.7            19.0
3  2019-05-07 05:00:00              NaN           50.4            16.0
4  2019-05-07 06:00:00              NaN           61.9             NaN
5  2019-05-07 07:00:00              NaN           72.4            26.0
6  2019-05-07 08:00:00              NaN           77.7            32.0
7  2019-05-07 09:00:00              NaN           67.9            32.0
8  2019-05-07 10:00:00              NaN           56.0            28.0
9  2019-05-07 11:00:00              NaN           34.5            21.0

In [42]:
df.tail(10)

                 datetime  station_antwerp  station_paris  station_london
1025  2019-06-20 17:00:00              NaN           19.3             NaN
1026  2019-06-20 18:00:00              NaN           19.0             NaN
1027  2019-06-20 19:00:00              NaN           23.2             NaN
1028  2019-06-20 20:00:00              NaN           23.9             NaN
1029  2019-06-20 21:00:00              NaN           25.3             NaN
1030  2019-06-20 22:00:00              NaN           21.4             NaN
1031  2019-06-20 23:00:00              NaN           24.9             NaN
1032  2019-06-21 00:00:00              NaN           26.5             NaN
1033  2019-06-21 01:00:00              NaN           21.8             NaN
1034  2019-06-21 02:00:00              NaN           20.0             NaN

In [43]:
df1.isnull()

      datetime  station_antwerp  station_paris  station_london
0        False             True           True           False
1        False            False          False           False
2        False            False          False           False
3        False             True          False           False
4        False             True          False            True
...        ...              ...            ...             ...
1030     False             True          False            True
1031     False             True          False            True
1032     False             True          False            True
1033     False             True          False            True
1034     False             True          False            True

[1035 rows x 4 columns]

In [46]:
df1.isnull().sum()

datetime             0
station_antwerp    940
station_paris       31
station_london      66
dtype: int64

In [47]:
x = df1.dropna()
x

                datetime  station_antwerp  station_paris  station_london
1    2019-05-07 03:00:00             50.5           25.0            19.0
2    2019-05-07 04:00:00             45.0           27.7            19.0
25   2019-05-08 03:00:00             23.0           19.6            20.0
26   2019-05-08 04:00:00             20.5           15.3            20.0
49   2019-05-09 03:00:00             20.0           10.6            31.0
..                   ...              ...            ...             ...
988  2019-06-17 06:00:00             39.5           45.7            11.0
989  2019-06-17 07:00:00             42.5           44.8            12.0
990  2019-06-17 08:00:00             43.5           52.3            13.0
991  2019-06-17 09:00:00             45.0           54.4            13.0
992  2019-06-17 10:00:00             41.0           51.6            11.0

[93 rows x 4 columns]

In [49]:
x.info()

<class 'pandas.core.frame.DataFrame'>
Index: 93 entries, 1 to 992
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   datetime         93 non-null     object
 1   station_antwerp  93 non-null     float64
 2   station_paris    93 non-null     float64
 3   station_london   93 non-null     float64
dtypes: float64(3), object(1)
memory usage: 3.6+ KB

In [50]:
df1.dropna(inplace=True)
df1

                datetime  station_antwerp  station_paris  station_london
1    2019-05-07 03:00:00             50.5           25.0            19.0
2    2019-05-07 04:00:00             45.0           27.7            19.0
25   2019-05-08 03:00:00             23.0           19.6            20.0
26   2019-05-08 04:00:00             20.5           15.3            20.0
49   2019-05-09 03:00:00             20.0           10.6            31.0
..                   ...              ...            ...             ...
988  2019-06-17 06:00:00             39.5           45.7            11.0
989  2019-06-17 07:00:00             42.5           44.8            12.0
990  2019-06-17 08:00:00             43.5           52.3            13.0
991  2019-06-17 09:00:00             45.0           54.4            13.0
992  2019-06-17 10:00:00             41.0           51.6            11.0

[93 rows x 4 columns]

In [51]:
df2=df.copy()
df2

                 datetime  station_antwerp  station_paris  station_london
0     2019-05-07 02:00:00              NaN            NaN            23.0
1     2019-05-07 03:00:00             50.5           25.0            19.0
2     2019-05-07 04:00:00             45.0           27.7            19.0
3     2019-05-07 05:00:00              NaN           50.4            16.0
4     2019-05-07 06:00:00              NaN           61.9             NaN
...                   ...              ...            ...             ...
1030  2019-06-20 22:00:00              NaN           21.4             NaN
1031  2019-06-20 23:00:00              NaN           24.9             NaN
1032  2019-06-21 00:00:00              NaN           26.5             NaN
1033  2019-06-21 01:00:00              NaN           21.8             NaN
1034  2019-06-21 02:00:00              NaN           20.0             NaN

[1035 rows x 4 columns]

In [52]:
df2.isnull().sum()

datetime             0
station_antwerp    940
station_paris       31
station_london      66
dtype: int64

In [53]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   datetime         1035 non-null   object
 1   station_antwerp  95 non-null     float64
 2   station_paris    1004 non-null   float64
 3   station_london   969 non-null    float64
dtypes: float64(3), object(1)
memory usage: 32.5+ KB

In [54]:
df2.describe()

       station_antwerp  station_paris  station_london
count        95.000000    1004.000000      969.000000
mean         25.778947      27.740538       24.689370
std          12.682019      15.285746       11.296598
min           7.500000       0.000000        0.000000
25%          16.750000      16.500000       18.000000
50%          23.000000      24.150000       25.000000
75%          34.500000      35.925000       31.000000
max          74.500000      97.000000       97.000000

In [55]:
df2.head()

              datetime  station_antwerp  station_paris  station_london
0  2019-05-07 02:00:00              NaN            NaN            23.0
1  2019-05-07 03:00:00             50.5           25.0            19.0
2  2019-05-07 04:00:00             45.0           27.7            19.0
3  2019-05-07 05:00:00              NaN           50.4            16.0
4  2019-05-07 06:00:00              NaN           61.9             NaN

In [56]:
df2.fillna(25.778947, inplace=True)

In [57]:
df2.head()

              datetime  station_antwerp  station_paris  station_london
0  2019-05-07 02:00:00        25.778947      25.778947       23.000000
1  2019-05-07 03:00:00        50.500000      25.000000       19.000000
2  2019-05-07 04:00:00        45.000000      27.700000       19.000000
3  2019-05-07 05:00:00        25.778947      50.400000       16.000000
4  2019-05-07 06:00:00        25.778947      61.900000       25.778947

In [58]:
df2.isnull().sum()

datetime           0
station_antwerp    0
station_paris      0
station_london     0
dtype: int64